Ran Apply for project: `github` dir: `apps/github` workspace: `github`

**Apply Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform apply -input=false -no-color \\-\\a\\u\\t\\o\\-\\a\\p\\p\\r\\o\\v\\e" in "/atlantis-data/repos/mvaldes14/terraform/57/github/apps/github": exit status 1
Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/mvaldes/github/runs/run-MYsYTH3sErjWMkmx

Waiting for the plan to start...

Terraform v1.5.7
on linux_amd64
Initializing plugins and modules...
data.github_repository.blog: Refreshing...
github_actions_secret.dockerhub_token["meal-notifier"]: Refreshing state... [id=meal-notifier:DOCKERHUB_TOKEN]
github_actions_secret.telegram_chat["meal-notifier"]: Refreshing state... [id=meal-notifier:TELEGRAM_TOKEN]
github_actions_secret.dockerhub_token["twitch-bot"]: Refreshing state... [id=twitch-bot:DOCKERHUB_TOKEN]
github_actions_secret.telegram_chat["twitch-bot"]: Refreshing state... [id=twitch-bot:TELEGRAM_TOKEN]
github_repository_webhook.wh["chef"]: Refreshing state... [id=521145056]
github_repository_webhook.wh["todoist.nvim"]: Refreshing state... [id=521309558]
github_repository_webhook.wh["meal-notifier"]: Refreshing state... [id=521145050]
github_repository_webhook.wh["dotfiles"]: Refreshing state... [id=521145038]
github_repository_webhook.wh["linear.nvim"]: Refreshing state... [id=521145043]
github_repository_webhook.wh["twitch-bot"]: Refreshing state... [id=521145035]
github_repository_webhook.wh["k8s-apps"]: Refreshing state... [id=521145049]
github_repository_webhook.wh["dotfiles-nix"]: Refreshing state... [id=521145046]
github_repository_webhook.wh["ansible_playbooks"]: Refreshing state... [id=521145032]
github_repository_webhook.wh["pulumi"]: Refreshing state... [id=521145026]
github_repository_webhook.wh["gh-actions"]: Refreshing state... [id=573195043]
github_repository_webhook.wh["deckmaster-config"]: Refreshing state... [id=521145053]
github_repository.repo["gh-actions"]: Refreshing state... [id=gh-actions]
github_repository.repo["wiki"]: Refreshing state... [id=wiki]
github_repository.repo["pulumi"]: Refreshing state... [id=pulumi]
github_repository.repo["todoist.nvim"]: Refreshing state... [id=todoist.nvim]
github_repository.repo["linear.nvim"]: Refreshing state... [id=linear.nvim]
github_repository.repo["dotfiles"]: Refreshing state... [id=dotfiles]
github_repository.repo["dotfiles-nix"]: Refreshing state... [id=dotfiles-nix]
github_repository.repo["twitch-bot"]: Refreshing state... [id=twitch-bot]
github_repository.repo["k8s-apps"]: Refreshing state... [id=k8s-apps]
github_repository.repo["chef"]: Refreshing state... [id=chef]
data.github_repository.blog: Refresh complete after 3s [id=blog]
github_repository.repo["ansible_playbooks"]: Refreshing state... [id=ansible_playbooks]
github_repository.repo["deckmaster-config"]: Refreshing state... [id=deckmaster-config]
github_repository.repo["meal-notifier"]: Refreshing state... [id=meal-notifier]
github_actions_secret.telegram_to["meal-notifier"]: Refreshing state... [id=meal-notifier:TELEGRAM_TO]
github_actions_secret.telegram_to["twitch-bot"]: Refreshing state... [id=twitch-bot:TELEGRAM_TO]
github_actions_secret.dockerhub_username["meal-notifier"]: Refreshing state... [id=meal-notifier:DOCKERHUB_USERNAME]
github_actions_secret.dockerhub_username["twitch-bot"]: Refreshing state... [id=twitch-bot:DOCKERHUB_USERNAME]
github_actions_secret.blog_docker_secret: Refreshing state... [id=blog:DOCKERHUB_USERNAME]
github_actions_secret.blog_docker_token: Refreshing state... [id=blog:DOCKERHUB_TOKEN]
github_repository.repo["k8s-apps"]: Drift detected (update)
github_repository.repo["pulumi"]: Drift detected (update)
github_repository.repo["chef"]: Drift detected (update)
github_repository.repo["dotfiles"]: Drift detected (update)
github_repository.repo["wiki"]: Drift detected (update)
github_repository.repo["dotfiles-nix"]: Drift detected (update)
github_repository.repo["deckmaster-config"]: Drift detected (update)
github_repository.repo["twitch-bot"]: Drift detected (update)
github_repository.repo["ansible_playbooks"]: Drift detected (update)
github_repository.repo["meal-notifier"]: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # github_repository.repo["deckmaster-config"] will be destroyed
  - resource "github_repository" "repo" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = false -> null
      - etag                        = "W/\"316ce4bcf6e0b346d8fb6412e5bc753e12c6dd8fe96921c0323a1b4f6d794bbe\"" -> null
      - full_name                   = "mvaldes14/deckmaster-config" -> null
      - git_clone_url               = "git://github.com/mvaldes14/deckmaster-config.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = true -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/mvaldes14/deckmaster-config" -> null
      - http_clone_url              = "https://github.com/mvaldes14/deckmaster-config.git" -> null
      - id                          = "deckmaster-config" -> null
      - is_template                 = false -> null
      - license_template            = "MIT" -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "deckmaster-config" -> null
      - node_id                     = "R_kgDOLHF-WQ" -> null
      - private                     = false -> null
      - repo_id                     = 745635417 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:mvaldes14/deckmaster-config.git" -> null
      - svn_url                     = "https://github.com/mvaldes14/deckmaster-config" -> null
      - topics                      = [
          - "homelab",
        ] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = true -> null
      - web_commit_signoff_required = false -> null

      - security_and_analysis {
          - secret_scanning {
              - status = "disabled" -> null
            }
          - secret_scanning_push_protection {
              - status = "disabled" -> null
            }
        }
    }

  # github_repository.repo["k8s-lsp"] will be created
  + resource "github_repository" "repo" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + license_template            = "MIT"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "k8s-lsp"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "neovim",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false
    }

  # github_repository.repo["wiki"] will be destroyed
  - resource "github_repository" "repo" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = false -> null
      - etag                        = "W/\"131510884baf3a9c71c8ec56dcc0f5cdd66faadef741b15ffb377a49ced38409\"" -> null
      - full_name                   = "mvaldes14/wiki" -> null
      - git_clone_url               = "git://github.com/mvaldes14/wiki.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = true -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/mvaldes14/wiki" -> null
      - http_clone_url              = "https://github.com/mvaldes14/wiki.git" -> null
      - id                          = "wiki" -> null
      - is_template                 = false -> null
      - license_template            = "MIT" -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "wiki" -> null
      - node_id                     = "R_kgDOP7uDpQ" -> null
      - private                     = true -> null
      - repo_id                     = 1069253541 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:mvaldes14/wiki.git" -> null
      - svn_url                     = "https://github.com/mvaldes14/wiki" -> null
      - topics                      = [
          - "personal",
        ] -> null
      - visibility                  = "private" -> null
      - vulnerability_alerts        = true -> null
      - web_commit_signoff_required = false -> null
    }

  # github_repository_webhook.wh["deckmaster-config"] will be destroyed
  - resource "github_repository_webhook" "wh" {
      - active     = true -> null
      - events     = [
          - "*",
        ] -> null
      - id         = "521145053" -> null
      - repository = "deckmaster-config" -> null
      - url        = "https://api.github.com/repos/mvaldes14/deckmaster-config/hooks/521145053" -> null

      - configuration {
          - content_type = "json" -> null
          - insecure_ssl = false -> null
          - secret       = (sensitive value) -> null
          - url          = (sensitive value) -> null
        }
    }

  # github_repository_webhook.wh["k8s-lsp"] will be created
  + resource "github_repository_webhook" "wh" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "*",
        ]
      + id         = (known after apply)
      + repository = "k8s-lsp"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

Plan: 2 to add, 0 to change, 3 to destroy.

github_repository_webhook.wh["deckmaster-config"]: Destroying... [id=521145053]
github_repository.repo["wiki"]: Destroying... [id=wiki]
github_repository.repo["deckmaster-config"]: Destroying... [id=deckmaster-config]
github_repository_webhook.wh["k8s-lsp"]: Creating...
github_repository.repo["k8s-lsp"]: Creating...
github_repository_webhook.wh["deckmaster-config"]: Destruction complete after 0s
github_repository.repo["wiki"]: Destruction complete after 2s
github_repository.repo["deckmaster-config"]: Destruction complete after 3s
github_repository.repo["k8s-lsp"]: Still creating... [10s elapsed]
github_repository.repo["k8s-lsp"]: Creation complete after 16s [id=k8s-lsp]
╷
│ Error: POST https://api.github.com/repos/mvaldes14/k8s-lsp/hooks: 404 Not Found []
│
│   with github_repository_webhook.wh["k8s-lsp"],
│   on main.tf line 51, in resource "github_repository_webhook" "wh":
│   51: resource "github_repository_webhook" "wh" {
│
╵
Operation failed: failed running terraform apply (exit 1)
```
</details>